RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7100_176_teqfp.c
/* Connections for: scb_uart_rts */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rts[17] = {
    {0u, 0u, P0_2, P0_2_SCB0_UART_RTS},
    {7u, 0u, P2_2, P2_2_SCB7_UART_RTS},
    {6u, 0u, P3_2, P3_2_SCB6_UART_RTS},
    {5u, 0u, P4_2, P4_2_SCB5_UART_RTS},
    {4u, 0u, P6_2, P6_2_SCB4_UART_RTS},
    {5u, 0u, P7_2, P7_2_SCB5_UART_RTS},
    {4u, 0u, P10_2, P10_2_SCB4_UART_RTS},
    {8u, 0u, P12_2, P12_2_SCB8_UART_RTS},
    {3u, 0u, P13_2, P13_2_SCB3_UART_RTS},
    {2u, 0u, P14_2, P14_2_SCB2_UART_RTS},
    {9u, 0u, P15_2, P15_2_SCB9_UART_RTS},
    {3u, 0u, P17_3, P17_3_SCB3_UART_RTS},
    {1u, 0u, P18_2, P18_2_SCB1_UART_RTS},
    {2u, 0u, P19_2, P19_2_SCB2_UART_RTS},
    {1u, 0u, P20_5, P20_5_SCB1_UART_RTS},
    {6u, 0u, P22_2, P22_2_SCB6_UART_RTS},
    {7u, 0u, P23_2, P23_2_SCB7_UART_RTS},
};

/* Connections for: scb_uart_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rx[17] = {
    {0u, 0u, P0_0, P0_0_SCB0_UART_RX},
    {7u, 0u, P2_0, P2_0_SCB7_UART_RX},
    {6u, 0u, P3_0, P3_0_SCB6_UART_RX},
    {5u, 0u, P4_0, P4_0_SCB5_UART_RX},
    {4u, 0u, P6_0, P6_0_SCB4_UART_RX},
    {5u, 0u, P7_0, P7_0_SCB5_UART_RX},
    {4u, 0u, P10_0, P10_0_SCB4_UART_RX},
    {8u, 0u, P12_0, P12_0_SCB8_UART_RX},
    {3u, 0u, P13_0, P13_0_SCB3_UART_RX},
    {2u, 0u, P14_0, P14_0_SCB2_UART_RX},
    {9u, 0u, P15_0, P15_0_SCB9_UART_RX},
    {3u, 0u, P17_1, P17_1_SCB3_UART_RX},
    {1u, 0u, P18_0, P18_0_SCB1_UART_RX},
    {2u, 0u, P19_0, P19_0_SCB2_UART_RX},
    {1u, 0u, P20_3, P20_3_SCB1_UART_RX},
    {6u, 0u, P21_7, P21_7_SCB6_UART_RX},
    {7u, 0u, P23_0, P23_0_SCB7_UART_RX},
};

/* Connections for: scb_uart_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_tx[17] = {
    {0u, 0u, P0_1, P0_1_SCB0_UART_TX},
    {7u, 0u, P2_1, P2_1_SCB7_UART_TX},
    {6u, 0u, P3_1, P3_1_SCB6_UART_TX},
    {5u, 0u, P4_1, P4_1_SCB5_UART_TX},
    {4u, 0u, P6_1, P6_1_SCB4_UART_TX},
    {5u, 0u, P7_1, P7_1_SCB5_UART_TX},
    {4u, 0u, P10_1, P10_1_SCB4_UART_TX},
    {8u, 0u, P12_1, P12_1_SCB8_UART_TX},
    {3u, 0u, P13_1, P13_1_SCB3_UART_TX},
    {2u, 0u, P14_1, P14_1_SCB2_UART_TX},
    {9u, 0u, P15_1, P15_1_SCB9_UART_TX},
    {3u, 0u, P17_2, P17_2_SCB3_UART_TX},
    {1u, 0u, P18_1, P18_1_SCB1_UART_TX},
    {2u, 0u, P19_1, P19_1_SCB2_UART_TX},
    {1u, 0u, P20_4, P20_4_SCB1_UART_TX},
    {6u, 0u, P22_1, P22_1_SCB6_UART_TX},
    {7u, 0u, P23_1, P23_1_SCB7_UART_TX},
};

/* Connections for: sdhc_card_cmd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_cmd[1] = {
    {0u, 0u, P6_3, P6_3_SDHC0_CARD_CMD},
};

/* Connections for: sdhc_card_dat_3to0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_3to0[4] = {
    {0u, 0u, P7_1, P7_1_SDHC0_CARD_DAT_3TO00},
    {0u, 1u, P7_2, P7_2_SDHC0_CARD_DAT_3TO01},
    {0u, 2u, P7_3, P7_3_SDHC0_CARD_DAT_3TO02},
    {0u, 3u, P7_4, P7_4_SDHC0_CARD_DAT_3TO03},
};

/* Connections for: sdhc_card_dat_7to4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_7to4[4] = {
    {0u, 0u, P7_5, P7_5_SDHC0_CARD_DAT_7TO40},
    {0u, 1u, P8_0, P8_0_SDHC0_CARD_DAT_7TO41},
    {0u, 2u, P8_1, P8_1_SDHC0_CARD_DAT_7TO42},
    {0u, 3u, P8_2, P8_2_SDHC0_CARD_DAT_7TO43},
};

/* Connections for: sdhc_card_detect_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_detect_n[1] = {
    {0u, 0u, P6_5, P6_5_SDHC0_CARD_DETECT_N},
};

/* Connections for: sdhc_card_if_pwr_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_if_pwr_en[1] = {
    {0u, 0u, P7_0, P7_0_SDHC0_CARD_IF_PWR_EN},
};

/* Connections for: sdhc_card_mech_write_prot */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_mech_write_prot[1] = {
    {0u, 0u, P6_2, P6_2_SDHC0_CARD_MECH_WRITE_PROT},
};

/* Connections for: sdhc_clk_card */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_clk_card[1] = {
    {0u, 0u, P6_4, P6_4_SDHC0_CLK_CARD},
};

/* Connections for: smif_spi_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_clk[1] = {
    {0u, 0u, P6_3, P6_3_SMIF0_SPIHB_CLK},
};

/* Connections for: smif_spi_data0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data0[1] = {
    {0u, 0u, P7_1, P7_1_SMIF0_SPIHB_DATA0},
};

/* Connections for: smif_spi_data1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data1[1] = {
    {0u, 0u, P7_2, P7_2_SMIF0_SPIHB_DATA1},
};

/* Connections for: smif_spi_data2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data2[1] = {
    {0u, 0u, P7_3, P7_3_SMIF0_SPIHB_DATA2},
};

/* Connections for: smif_spi_data3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data3[1] = {
    {0u, 0u, P7_4, P7_4_SMIF0_SPIHB_DATA3},
};

/* Connections for: smif_spi_data4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data4[1] = {
    {0u, 0u, P7_5, P7_5_SMIF0_SPIHB_DATA4},
};

/* Connections for: smif_spi_data5 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data5[1] = {
    {0u, 0u, P8_0, P8_0_SMIF0_SPIHB_DATA5},
};

/* Connections for: smif_spi_data6 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data6[1] = {
    {0u, 0u, P8_1, P8_1_SMIF0_SPIHB_DATA6},
};

/* Connections for: smif_spi_data7 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data7[1] = {
    {0u, 0u, P8_2, P8_2_SMIF0_SPIHB_DATA7},
};

/* Connections for: smif_spi_rwds */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_rwds[1] = {
    {0u, 0u, P6_4, P6_4_SMIF0_SPIHB_RWDS},
};

/* Connections for: smif_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select0[1] = {
    {0u, 0u, P6_5, P6_5_SMIF0_SPIHB_SELECT0},
};

/* Connections for: smif_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select1[1] = {
    {0u, 0u, P7_0, P7_0_SMIF0_SPIHB_SELECT1},
};

/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[163] = {
    {0u, 18u, P0_0, P0_0_TCPWM0_LINE18},
    {0u, 17u, P0_1, P0_1_TCPWM0_LINE17},
    {0u, 14u, P0_2, P0_2_TCPWM0_LINE14},
    {0u, 13u, P0_3, P0_3_TCPWM0_LINE13},
    {0u, 12u, P1_0, P1_0_TCPWM0_LINE12},
    {2u, 4u, P1_0, P1_0_TCPWM0_LINE516},
    {0u, 11u, P1_1, P1_1_TCPWM0_LINE11},
    {2u, 5u, P1_1, P1_1_TCPWM0_LINE517},
    {0u, 10u, P1_2, P1_2_TCPWM0_LINE10},
    {2u, 6u, P1_2, P1_2_TCPWM0_LINE518},
    {0u, 8u, P1_3, P1_3_TCPWM0_LINE8},
    {2u, 7u, P1_3, P1_3_TCPWM0_LINE519},
    {0u, 7u, P2_0, P2_0_TCPWM0_LINE7},
    {0u, 6u, P2_1, P2_1_TCPWM0_LINE6},
    {0u, 5u, P2_2, P2_2_TCPWM0_LINE5},
    {0u, 4u, P2_3, P2_3_TCPWM0_LINE4},
    {0u, 3u, P2_4, P2_4_TCPWM0_LINE3},
    {0u, 2u, P2_5, P2_5_TCPWM0_LINE2},
    {0u, 1u, P3_0, P3_0_TCPWM0_LINE1},
    {0u, 0u, P3_1, P3_1_TCPWM0_LINE0},
    {1u, 3u, P3_2, P3_2_TCPWM0_LINE259},
    {1u, 2u, P3_3, P3_3_TCPWM0_LINE258},
    {1u, 1u, P3_4, P3_4_TCPWM0_LINE257},
    {1u, 0u, P3_5, P3_5_TCPWM0_LINE256},
    {0u, 4u, P4_0, P4_0_TCPWM0_LINE4},
    {0u, 5u, P4_1, P4_1_TCPWM0_LINE5},
    {0u, 6u, P4_2, P4_2_TCPWM0_LINE6},
    {0u, 7u, P4_3, P4_3_TCPWM0_LINE7},
    {0u, 8u, P4_4, P4_4_TCPWM0_LINE8},
    {0u, 9u, P5_0, P5_0_TCPWM0_LINE9},
    {0u, 10u, P5_1, P5_1_TCPWM0_LINE10},
    {0u, 11u, P5_2, P5_2_TCPWM0_LINE11},
    {0u, 12u, P5_3, P5_3_TCPWM0_LINE12},
    {0u, 13u, P5_4, P5_4_TCPWM0_LINE13},
    {0u, 14u, P5_5, P5_5_TCPWM0_LINE14},
    {1u, 0u, P6_0, P6_0_TCPWM0_LINE256},
    {0u, 0u, P6_1, P6_1_TCPWM0_LINE0},
    {1u, 1u, P6_2, P6_2_TCPWM0_LINE257},
    {0u, 1u, P6_3, P6_3_TCPWM0_LINE1},
    {1u, 2u, P6_4, P6_4_TCPWM0_LINE258},
    {0u, 2u, P6_5, P6_5_TCPWM0_LINE2},
    {1u, 3u, P6_6, P6_6_TCPWM0_LINE259},
    {0u, 3u, P6_7, P6_7_TCPWM0_LINE3},
    {1u, 4u, P7_0, P7_0_TCPWM0_LINE260},
    {0u, 15u, P7_1, P7_1_TCPWM0_LINE15},
    {1u, 5u, P7_2, P7_2_TCPWM0_LINE261},
    {0u, 16u, P7_3, P7_3_TCPWM0_LINE16},
    {1u, 6u, P7_4, P7_4_TCPWM0_LINE262},
    {0u, 17u, P7_5, P7_5_TCPWM0_LINE17},
    {1u, 7u, P7_6, P7_6_TCPWM0_LINE263},
    {0u, 18u, P7_7, P7_7_TCPWM0_LINE18},
    {0u, 19u, P8_0, P8_0_TCPWM0_LINE19},
    {0u, 20u, P8_1, P8_1_TCPWM0_LINE20},
    {0u, 21u, P8_2, P8_2_TCPWM0_LINE21},
    {0u, 22u, P8_3, P8_3_TCPWM0_LINE22},
    {0u, 23u, P8_4, P8_4_TCPWM0_LINE23},
    {0u, 24u, P9_0, P9_0_TCPWM0_LINE24},
    {0u, 25u, P9_1, P9_1_TCPWM0_LINE25},
    {0u, 26u, P9_2, P9_2_TCPWM0_LINE26},
    {0u, 27u, P9_3, P9_3_TCPWM0_LINE27},
    {0u, 28u, P10_0, P10_0_TCPWM0_LINE28},
    {0u, 29u, P10_1, P10_1_TCPWM0_LINE29},
    {0u, 30u, P10_2, P10_2_TCPWM0_LINE30},
    {0u, 31u, P10_3, P10_3_TCPWM0_LINE31},
    {0u, 32u, P10_4, P10_4_TCPWM0_LINE32},
    {0u, 33u, P10_5, P10_5_TCPWM0_LINE33},
    {0u, 34u, P10_6, P10_6_TCPWM0_LINE34},
    {0u, 35u, P10_7, P10_7_TCPWM0_LINE35},
    {0u, 61u, P11_0, P11_0_TCPWM0_LINE61},
    {0u, 60u, P11_1, P11_1_TCPWM0_LINE60},
    {0u, 59u, P11_2, P11_2_TCPWM0_LINE59},
    {0u, 36u, P12_0, P12_0_TCPWM0_LINE36},
    {0u, 37u, P12_1, P12_1_TCPWM0_LINE37},
    {0u, 38u, P12_2, P12_2_TCPWM0_LINE38},
    {0u, 39u, P12_3, P12_3_TCPWM0_LINE39},
    {0u, 40u, P12_4, P12_4_TCPWM0_LINE40},
    {0u, 41u, P12_5, P12_5_TCPWM0_LINE41},
    {0u, 42u, P12_6, P12_6_TCPWM0_LINE42},
    {0u, 43u, P12_7, P12_7_TCPWM0_LINE43},
    {1u, 8u, P13_0, P13_0_TCPWM0_LINE264},
    {0u, 44u, P13_1, P13_1_TCPWM0_LINE44},
    {1u, 9u, P13_2, P13_2_TCPWM0_LINE265},
    {0u, 45u, P13_3, P13_3_TCPWM0_LINE45},
    {1u, 10u, P13_4, P13_4_TCPWM0_LINE266},
    {2u, 4u, P13_4, P13_4_TCPWM0_LINE516},
    {0u, 46u, P13_5, P13_5_TCPWM0_LINE46},
    {1u, 11u, P13_6, P13_6_TCPWM0_LINE267},
    {2u, 5u, P13_6, P13_6_TCPWM0_LINE517},
    {0u, 47u, P13_7, P13_7_TCPWM0_LINE47},
    {0u, 48u, P14_0, P14_0_TCPWM0_LINE48},
    {2u, 6u, P14_0, P14_0_TCPWM0_LINE518},
    {0u, 49u, P14_1, P14_1_TCPWM0_LINE49},
    {0u, 50u, P14_2, P14_2_TCPWM0_LINE50},
    {2u, 7u, P14_2, P14_2_TCPWM0_LINE519},
    {0u, 51u, P14_3, P14_3_TCPWM0_LINE51},
    {0u, 52u, P14_4, P14_4_TCPWM0_LINE52},
    {0u, 53u, P14_5, P14_5_TCPWM0_LINE53},
    {0u, 54u, P14_6, P14_6_TCPWM0_LINE54},
    {0u, 55u, P14_7, P14_7_TCPWM0_LINE55},
    {0u, 56u, P15_0, P15_0_TCPWM0_LINE56},
    {0u, 57u, P15_1, P15_1_TCPWM0_LINE57},
    {0u, 58u, P15_2, P15_2_TCPWM0_LINE58},
    {0u, 59u, P15_3, P15_3_TCPWM0_LINE59},
    {0u, 62u, P16_3, P16_3_TCPWM0_LINE62},
    {0u, 61u, P17_0, P17_0_TCPWM0_LINE61},
    {0u, 60u, P17_1, P17_1_TCPWM0_LINE60},
    {0u, 59u, P17_2, P17_2_TCPWM0_LINE59},
    {0u, 58u, P17_3, P17_3_TCPWM0_LINE58},
    {2u, 3u, P17_3, P17_3_TCPWM0_LINE515},
    {0u, 57u, P17_4, P17_4_TCPWM0_LINE57},
    {0u, 56u, P17_5, P17_5_TCPWM0_LINE56},
    {2u, 2u, P17_5, P17_5_TCPWM0_LINE514},
    {1u, 4u, P17_6, P17_6_TCPWM0_LINE260},
    {1u, 5u, P17_7, P17_7_TCPWM0_LINE261},
    {1u, 6u, P18_0, P18_0_TCPWM0_LINE262},
    {2u, 0u, P18_0, P18_0_TCPWM0_LINE512},
    {1u, 7u, P18_1, P18_1_TCPWM0_LINE263},
    {0u, 55u, P18_2, P18_2_TCPWM0_LINE55},
    {2u, 1u, P18_2, P18_2_TCPWM0_LINE513},
    {0u, 54u, P18_3, P18_3_TCPWM0_LINE54},
    {0u, 53u, P18_4, P18_4_TCPWM0_LINE53},
    {2u, 2u, P18_4, P18_4_TCPWM0_LINE514},
    {0u, 52u, P18_5, P18_5_TCPWM0_LINE52},
    {0u, 51u, P18_6, P18_6_TCPWM0_LINE51},
    {2u, 3u, P18_6, P18_6_TCPWM0_LINE515},
    {0u, 50u, P18_7, P18_7_TCPWM0_LINE50},
    {1u, 3u, P19_0, P19_0_TCPWM0_LINE259},
    {0u, 26u, P19_1, P19_1_TCPWM0_LINE26},
    {0u, 27u, P19_2, P19_2_TCPWM0_LINE27},
    {0u, 28u, P19_3, P19_3_TCPWM0_LINE28},
    {0u, 29u, P19_4, P19_4_TCPWM0_LINE29},
    {0u, 30u, P20_0, P20_0_TCPWM0_LINE30},
    {0u, 49u, P20_1, P20_1_TCPWM0_LINE49},
    {0u, 48u, P20_2, P20_2_TCPWM0_LINE48},
    {0u, 47u, P20_3, P20_3_TCPWM0_LINE47},
    {0u, 46u, P20_4, P20_4_TCPWM0_LINE46},
    {0u, 45u, P20_5, P20_5_TCPWM0_LINE45},
    {0u, 44u, P20_6, P20_6_TCPWM0_LINE44},
    {0u, 43u, P20_7, P20_7_TCPWM0_LINE43},
    {0u, 42u, P21_0, P21_0_TCPWM0_LINE42},
    {0u, 41u, P21_1, P21_1_TCPWM0_LINE41},
    {0u, 40u, P21_2, P21_2_TCPWM0_LINE40},
    {0u, 39u, P21_3, P21_3_TCPWM0_LINE39},
    {0u, 38u, P21_4, P21_4_TCPWM0_LINE38},
    {0u, 34u, P21_5, P21_5_TCPWM0_LINE34},
    {0u, 37u, P21_5, P21_5_TCPWM0_LINE37},
    {0u, 36u, P21_6, P21_6_TCPWM0_LINE36},
    {0u, 35u, P21_7, P21_7_TCPWM0_LINE35},
    {0u, 33u, P22_1, P22_1_TCPWM0_LINE33},
    {0u, 32u, P22_2, P22_2_TCPWM0_LINE32},
    {0u, 31u, P22_3, P22_3_TCPWM0_LINE31},
    {0u, 30u, P22_4, P22_4_TCPWM0_LINE30},
    {0u, 29u, P22_5, P22_5_TCPWM0_LINE29},
    {0u, 28u, P22_6, P22_6_TCPWM0_LINE28},
    {0u, 27u, P22_7, P22_7_TCPWM0_LINE27},
    {1u, 8u, P23_0, P23_0_TCPWM0_LINE264},
    {1u, 9u, P23_1, P23_1_TCPWM0_LINE265},
    {1u, 10u, P23_2, P23_2_TCPWM0_LINE266},
    {1u, 11u, P23_3, P23_3_TCPWM0_LINE267},
    {0u, 25u, P23_4, P23_4_TCPWM0_LINE25},
    {0u, 24u, P23_5, P23_5_TCPWM0_LINE24},
    {0u, 23u, P23_6, P23_6_TCPWM0_LINE23},
    {0u, 22u, P23_7, P23_7_TCPWM0_LINE22},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[164] = {
    {0u, 22u, P0_0, P0_0_TCPWM0_LINE_COMPL22},
    {0u, 18u, P0_1, P0_1_TCPWM0_LINE_COMPL18},
    {0u, 17u, P0_2, P0_2_TCPWM0_LINE_COMPL17},
    {0u, 14u, P0_3, P0_3_TCPWM0_LINE_COMPL14},
    {0u, 13u, P1_0, P1_0_TCPWM0_LINE_COMPL13},
    {0u, 12u, P1_1, P1_1_TCPWM0_LINE_COMPL12},
    {0u, 11u, P1_2, P1_2_TCPWM0_LINE_COMPL11},
    {0u, 10u, P1_3, P1_3_TCPWM0_LINE_COMPL10},
    {0u, 8u, P2_0, P2_0_TCPWM0_LINE_COMPL8},
    {0u, 7u, P2_1, P2_1_TCPWM0_LINE_COMPL7},
    {0u, 6u, P2_2, P2_2_TCPWM0_LINE_COMPL6},
    {0u, 5u, P2_3, P2_3_TCPWM0_LINE_COMPL5},
    {0u, 4u, P2_4, P2_4_TCPWM0_LINE_COMPL4},
    {2u, 4u, P2_4, P2_4_TCPWM0_LINE_COMPL516},
    {0u, 3u, P2_5, P2_5_TCPWM0_LINE_COMPL3},
    {2u, 5u, P2_5, P2_5_TCPWM0_LINE_COMPL517},
    {0u, 2u, P3_0, P3_0_TCPWM0_LINE_COMPL2},
    {2u, 6u, P3_0, P3_0_TCPWM0_LINE_COMPL518},
    {0u, 1u, P3_1, P3_1_TCPWM0_LINE_COMPL1},
    {2u, 7u, P3_1, P3_1_TCPWM0_LINE_COMPL519},
    {0u, 0u, P3_2, P3_2_TCPWM0_LINE_COMPL0},
    {1u, 3u, P3_3, P3_3_TCPWM0_LINE_COMPL259},
    {1u, 2u, P3_4, P3_4_TCPWM0_LINE_COMPL258},
    {1u, 1u, P3_5, P3_5_TCPWM0_LINE_COMPL257},
    {1u, 0u, P4_0, P4_0_TCPWM0_LINE_COMPL256},
    {0u, 4u, P4_1, P4_1_TCPWM0_LINE_COMPL4},
    {0u, 5u, P4_2, P4_2_TCPWM0_LINE_COMPL5},
    {0u, 6u, P4_3, P4_3_TCPWM0_LINE_COMPL6},
    {0u, 7u, P4_4, P4_4_TCPWM0_LINE_COMPL7},
    {0u, 8u, P5_0, P5_0_TCPWM0_LINE_COMPL8},
    {0u, 9u, P5_1, P5_1_TCPWM0_LINE_COMPL9},
    {0u, 10u, P5_2, P5_2_TCPWM0_LINE_COMPL10},
    {0u, 11u, P5_3, P5_3_TCPWM0_LINE_COMPL11},
    {0u, 12u, P5_4, P5_4_TCPWM0_LINE_COMPL12},
    {0u, 13u, P5_5, P5_5_TCPWM0_LINE_COMPL13},
    {0u, 14u, P6_0, P6_0_TCPWM0_LINE_COMPL14},
    {1u, 0u, P6_1, P6_1_TCPWM0_LINE_COMPL256},
    {0u, 0u, P6_2, P6_2_TCPWM0_LINE_COMPL0},
    {1u, 1u, P6_3, P6_3_TCPWM0_LINE_COMPL257},
    {0u, 1u, P6_4, P6_4_TCPWM0_LINE_COMPL1},
    {1u, 2u, P6_5, P6_5_TCPWM0_LINE_COMPL258},
    {0u, 2u, P6_6, P6_6_TCPWM0_LINE_COMPL2},
    {1u, 3u, P6_7, P6_7_TCPWM0_LINE_COMPL259},
    {0u, 3u, P7_0, P7_0_TCPWM0_LINE_COMPL3},
    {1u, 4u, P7_1, P7_1_TCPWM0_LINE_COMPL260},
    {0u, 15u, P7_2, P7_2_TCPWM0_LINE_COMPL15},
    {1u, 5u, P7_3, P7_3_TCPWM0_LINE_COMPL261},
    {0u, 16u, P7_4, P7_4_TCPWM0_LINE_COMPL16},
    {1u, 6u, P7_5, P7_5_TCPWM0_LINE_COMPL262},
    {0u, 17u, P7_6, P7_6_TCPWM0_LINE_COMPL17},
    {1u, 7u, P7_7, P7_7_TCPWM0_LINE_COMPL263},
    {0u, 18u, P8_0, P8_0_TCPWM0_LINE_COMPL18},
    {0u, 19u, P8_1, P8_1_TCPWM0_LINE_COMPL19},
    {0u, 20u, P8_2, P8_2_TCPWM0_LINE_COMPL20},
    {0u, 21u, P8_3, P8_3_TCPWM0_LINE_COMPL21},
    {0u, 22u, P8_4, P8_4_TCPWM0_LINE_COMPL22},
    {0u, 23u, P9_0, P9_0_TCPWM0_LINE_COMPL23},
    {0u, 24u, P9_1, P9_1_TCPWM0_LINE_COMPL24},
    {0u, 25u, P9_2, P9_2_TCPWM0_LINE_COMPL25},
    {0u, 26u, P9_3, P9_3_TCPWM0_LINE_COMPL26},
    {0u, 27u, P10_0, P10_0_TCPWM0_LINE_COMPL27},
    {0u, 28u, P10_1, P10_1_TCPWM0_LINE_COMPL28},
    {0u, 29u, P10_2, P10_2_TCPWM0_LINE_COMPL29},
    {0u, 30u, P10_3, P10_3_TCPWM0_LINE_COMPL30},
    {0u, 31u, P10_4, P10_4_TCPWM0_LINE_COMPL31},
    {0u, 32u, P10_5, P10_5_TCPWM0_LINE_COMPL32},
    {0u, 33u, P10_6, P10_6_TCPWM0_LINE_COMPL33},
    {0u, 34u, P10_7, P10_7_TCPWM0_LINE_COMPL34},
    {0u, 62u, P11_0, P11_0_TCPWM0_LINE_COMPL62},
    {0u, 61u, P11_1, P11_1_TCPWM0_LINE_COMPL61},
    {0u, 60u, P11_2, P11_2_TCPWM0_LINE_COMPL60},
    {0u, 35u, P12_0, P12_0_TCPWM0_LINE_COMPL35},
    {0u, 36u, P12_1, P12_1_TCPWM0_LINE_COMPL36},
    {0u, 37u, P12_2, P12_2_TCPWM0_LINE_COMPL37},
    {0u, 38u, P12_3, P12_3_TCPWM0_LINE_COMPL38},
    {0u, 39u, P12_4, P12_4_TCPWM0_LINE_COMPL39},
    {0u, 40u, P12_5, P12_5_TCPWM0_LINE_COMPL40},
    {0u, 41u, P12_6, P12_6_TCPWM0_LINE_COMPL41},
    {0u, 42u, P12_7, P12_7_TCPWM0_LINE_COMPL42},
    {0u, 43u, P13_0, P13_0_TCPWM0_LINE_COMPL43},
    {1u, 8u, P13_1, P13_1_TCPWM0_LINE_COMPL264},
    {0u, 44u, P13_2, P13_2_TCPWM0_LINE_COMPL44},
    {1u, 9u, P13_3, P13_3_TCPWM0_LINE_COMPL265},
    {0u, 45u, P13_4, P13_4_TCPWM0_LINE_COMPL45},
    {1u, 10u, P13_5, P13_5_TCPWM0_LINE_COMPL266},
    {2u, 4u, P13_5, P13_5_TCPWM0_LINE_COMPL516},
    {0u, 46u, P13_6, P13_6_TCPWM0_LINE_COMPL46},
    {1u, 11u, P13_7, P13_7_TCPWM0_LINE_COMPL267},
    {2u, 5u, P13_7, P13_7_TCPWM0_LINE_COMPL517},
    {0u, 47u, P14_0, P14_0_TCPWM0_LINE_COMPL47},
    {0u, 48u, P14_1, P14_1_TCPWM0_LINE_COMPL48},
    {2u, 6u, P14_1, P14_1_TCPWM0_LINE_COMPL518},
    {0u, 49u, P14_2, P14_2_TCPWM0_LINE_COMPL49},
    {0u, 50u, P14_3, P14_3_TCPWM0_LINE_COMPL50},
    {2u, 7u, P14_3, P14_3_TCPWM0_LINE_COMPL519},
    {0u, 51u, P14_4, P14_4_TCPWM0_LINE_COMPL51},
    {0u, 52u, P14_5, P14_5_TCPWM0_LINE_COMPL52},
    {0u, 53u, P14_6, P14_6_TCPWM0_LINE_COMPL53},
    {0u, 54u, P14_7, P14_7_TCPWM0_LINE_COMPL54},
    {0u, 55u, P15_0, P15_0_TCPWM0_LINE_COMPL55},
    {0u, 56u, P15_1, P15_1_TCPWM0_LINE_COMPL56},
    {0u, 57u, P15_2, P15_2_TCPWM0_LINE_COMPL57},
    {0u, 58u, P15_3, P15_3_TCPWM0_LINE_COMPL58},
    {0u, 62u, P16_3, P16_3_TCPWM0_LINE_COMPL62},
    {2u, 1u, P16_3, P16_3_TCPWM0_LINE_COMPL513},
    {0u, 62u, P17_0, P17_0_TCPWM0_LINE_COMPL62},
    {0u, 61u, P17_1, P17_1_TCPWM0_LINE_COMPL61},
    {0u, 60u, P17_2, P17_2_TCPWM0_LINE_COMPL60},
    {0u, 59u, P17_3, P17_3_TCPWM0_LINE_COMPL59},
    {0u, 58u, P17_4, P17_4_TCPWM0_LINE_COMPL58},
    {2u, 3u, P17_4, P17_4_TCPWM0_LINE_COMPL515},
    {0u, 57u, P17_5, P17_5_TCPWM0_LINE_COMPL57},
    {0u, 56u, P17_6, P17_6_TCPWM0_LINE_COMPL56},
    {2u, 2u, P17_6, P17_6_TCPWM0_LINE_COMPL514},
    {1u, 4u, P17_7, P17_7_TCPWM0_LINE_COMPL260},
    {1u, 5u, P18_0, P18_0_TCPWM0_LINE_COMPL261},
    {1u, 6u, P18_1, P18_1_TCPWM0_LINE_COMPL262},
    {2u, 0u, P18_1, P18_1_TCPWM0_LINE_COMPL512},
    {1u, 7u, P18_2, P18_2_TCPWM0_LINE_COMPL263},
    {0u, 55u, P18_3, P18_3_TCPWM0_LINE_COMPL55},
    {2u, 1u, P18_3, P18_3_TCPWM0_LINE_COMPL513},
    {0u, 54u, P18_4, P18_4_TCPWM0_LINE_COMPL54},
    {0u, 53u, P18_5, P18_5_TCPWM0_LINE_COMPL53},
    {2u, 2u, P18_5, P18_5_TCPWM0_LINE_COMPL514},
    {0u, 52u, P18_6, P18_6_TCPWM0_LINE_COMPL52},
    {0u, 51u, P18_7, P18_7_TCPWM0_LINE_COMPL51},
    {2u, 3u, P18_7, P18_7_TCPWM0_LINE_COMPL515},
    {0u, 50u, P19_0, P19_0_TCPWM0_LINE_COMPL50},
    {1u, 3u, P19_1, P19_1_TCPWM0_LINE_COMPL259},
    {0u, 26u, P19_2, P19_2_TCPWM0_LINE_COMPL26},
    {0u, 27u, P19_3, P19_3_TCPWM0_LINE_COMPL27},
    {0u, 28u, P19_4, P19_4_TCPWM0_LINE_COMPL28},
    {0u, 29u, P20_0, P20_0_TCPWM0_LINE_COMPL29},
    {0u, 30u, P20_1, P20_1_TCPWM0_LINE_COMPL30},
    {0u, 49u, P20_2, P20_2_TCPWM0_LINE_COMPL49},
    {0u, 48u, P20_3, P20_3_TCPWM0_LINE_COMPL48},
    {0u, 47u, P20_4, P20_4_TCPWM0_LINE_COMPL47},
    {0u, 46u, P20_5, P20_5_TCPWM0_LINE_COMPL46},
    {0u, 45u, P20_6, P20_6_TCPWM0_LINE_COMPL45},
    {0u, 44u, P20_7, P20_7_TCPWM0_LINE_COMPL44},
    {0u, 43u, P21_0, P21_0_TCPWM0_LINE_COMPL43},
    {0u, 42u, P21_1, P21_1_TCPWM0_LINE_COMPL42},
    {0u, 41u, P21_2, P21_2_TCPWM0_LINE_COMPL41},
    {0u, 40u, P21_3, P21_3_TCPWM0_LINE_COMPL40},
    {0u, 39u, P21_4, P21_4_TCPWM0_LINE_COMPL39},
    {0u, 35u, P21_5, P21_5_TCPWM0_LINE_COMPL35},
    {0u, 38u, P21_5, P21_5_TCPWM0_LINE_COMPL38},
    {0u, 37u, P21_6, P21_6_TCPWM0_LINE_COMPL37},
    {0u, 36u, P21_7, P21_7_TCPWM0_LINE_COMPL36},
    {0u, 34u, P22_1, P22_1_TCPWM0_LINE_COMPL34},
    {0u, 33u, P22_2, P22_2_TCPWM0_LINE_COMPL33},
    {0u, 32u, P22_3, P22_3_TCPWM0_LINE_COMPL32},
    {0u, 31u, P22_4, P22_4_TCPWM0_LINE_COMPL31},
    {0u, 30u, P22_5, P22_5_TCPWM0_LINE_COMPL30},
    {0u, 29u, P22_6, P22_6_TCPWM0_LINE_COMPL29},
    {0u, 28u, P22_7, P22_7_TCPWM0_LINE_COMPL28},
    {0u, 27u, P23_0, P23_0_TCPWM0_LINE_COMPL27},
    {1u, 8u, P23_1, P23_1_TCPWM0_LINE_COMPL264},
    {1u, 9u, P23_2, P23_2_TCPWM0_LINE_COMPL265},
    {1u, 10u, P23_3, P23_3_TCPWM0_LINE_COMPL266},
    {1u, 11u, P23_4, P23_4_TCPWM0_LINE_COMPL267},
    {0u, 25u, P23_5, P23_5_TCPWM0_LINE_COMPL25},
    {0u, 24u, P23_6, P23_6_TCPWM0_LINE_COMPL24},
    {0u, 23u, P23_7, P23_7_TCPWM0_LINE_COMPL23},
};

