RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7100_176_teqfp.c
/* Connections for: tcpwm_tr_one_cnt_in */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_tr_one_cnt_in[322] = {
    {0u, 54u, P0_0, P0_0_TCPWM0_TR_ONE_CNT_IN54},
    {0u, 67u, P0_0, P0_0_TCPWM0_TR_ONE_CNT_IN67},
    {0u, 51u, P0_1, P0_1_TCPWM0_TR_ONE_CNT_IN51},
    {0u, 55u, P0_1, P0_1_TCPWM0_TR_ONE_CNT_IN55},
    {0u, 42u, P0_2, P0_2_TCPWM0_TR_ONE_CNT_IN42},
    {0u, 52u, P0_2, P0_2_TCPWM0_TR_ONE_CNT_IN52},
    {0u, 39u, P0_3, P0_3_TCPWM0_TR_ONE_CNT_IN39},
    {0u, 43u, P0_3, P0_3_TCPWM0_TR_ONE_CNT_IN43},
    {0u, 36u, P1_0, P1_0_TCPWM0_TR_ONE_CNT_IN36},
    {0u, 40u, P1_0, P1_0_TCPWM0_TR_ONE_CNT_IN40},
    {0u, 33u, P1_1, P1_1_TCPWM0_TR_ONE_CNT_IN33},
    {0u, 37u, P1_1, P1_1_TCPWM0_TR_ONE_CNT_IN37},
    {0u, 30u, P1_2, P1_2_TCPWM0_TR_ONE_CNT_IN30},
    {0u, 34u, P1_2, P1_2_TCPWM0_TR_ONE_CNT_IN34},
    {0u, 24u, P1_3, P1_3_TCPWM0_TR_ONE_CNT_IN24},
    {0u, 31u, P1_3, P1_3_TCPWM0_TR_ONE_CNT_IN31},
    {0u, 21u, P2_0, P2_0_TCPWM0_TR_ONE_CNT_IN21},
    {0u, 25u, P2_0, P2_0_TCPWM0_TR_ONE_CNT_IN25},
    {6u, 12u, P2_0, P2_0_TCPWM0_TR_ONE_CNT_IN1548},
    {0u, 18u, P2_1, P2_1_TCPWM0_TR_ONE_CNT_IN18},
    {0u, 22u, P2_1, P2_1_TCPWM0_TR_ONE_CNT_IN22},
    {6u, 15u, P2_1, P2_1_TCPWM0_TR_ONE_CNT_IN1551},
    {0u, 15u, P2_2, P2_2_TCPWM0_TR_ONE_CNT_IN15},
    {0u, 19u, P2_2, P2_2_TCPWM0_TR_ONE_CNT_IN19},
    {6u, 18u, P2_2, P2_2_TCPWM0_TR_ONE_CNT_IN1554},
    {0u, 12u, P2_3, P2_3_TCPWM0_TR_ONE_CNT_IN12},
    {0u, 16u, P2_3, P2_3_TCPWM0_TR_ONE_CNT_IN16},
    {6u, 21u, P2_3, P2_3_TCPWM0_TR_ONE_CNT_IN1557},
    {0u, 9u, P2_4, P2_4_TCPWM0_TR_ONE_CNT_IN9},
    {0u, 13u, P2_4, P2_4_TCPWM0_TR_ONE_CNT_IN13},
    {0u, 6u, P2_5, P2_5_TCPWM0_TR_ONE_CNT_IN6},
    {0u, 10u, P2_5, P2_5_TCPWM0_TR_ONE_CNT_IN10},
    {0u, 3u, P3_0, P3_0_TCPWM0_TR_ONE_CNT_IN3},
    {0u, 7u, P3_0, P3_0_TCPWM0_TR_ONE_CNT_IN7},
    {0u, 0u, P3_1, P3_1_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 4u, P3_1, P3_1_TCPWM0_TR_ONE_CNT_IN4},
    {0u, 1u, P3_2, P3_2_TCPWM0_TR_ONE_CNT_IN1},
    {3u, 9u, P3_2, P3_2_TCPWM0_TR_ONE_CNT_IN777},
    {6u, 13u, P3_2, P3_2_TCPWM0_TR_ONE_CNT_IN1549},
    {3u, 6u, P3_3, P3_3_TCPWM0_TR_ONE_CNT_IN774},
    {3u, 10u, P3_3, P3_3_TCPWM0_TR_ONE_CNT_IN778},
    {6u, 16u, P3_3, P3_3_TCPWM0_TR_ONE_CNT_IN1552},
    {3u, 3u, P3_4, P3_4_TCPWM0_TR_ONE_CNT_IN771},
    {3u, 7u, P3_4, P3_4_TCPWM0_TR_ONE_CNT_IN775},
    {6u, 19u, P3_4, P3_4_TCPWM0_TR_ONE_CNT_IN1555},
    {3u, 0u, P3_5, P3_5_TCPWM0_TR_ONE_CNT_IN768},
    {3u, 4u, P3_5, P3_5_TCPWM0_TR_ONE_CNT_IN772},
    {6u, 22u, P3_5, P3_5_TCPWM0_TR_ONE_CNT_IN1558},
    {0u, 12u, P4_0, P4_0_TCPWM0_TR_ONE_CNT_IN12},
    {3u, 1u, P4_0, P4_0_TCPWM0_TR_ONE_CNT_IN769},
    {0u, 13u, P4_1, P4_1_TCPWM0_TR_ONE_CNT_IN13},
    {0u, 15u, P4_1, P4_1_TCPWM0_TR_ONE_CNT_IN15},
    {0u, 16u, P4_2, P4_2_TCPWM0_TR_ONE_CNT_IN16},
    {0u, 18u, P4_2, P4_2_TCPWM0_TR_ONE_CNT_IN18},
    {0u, 19u, P4_3, P4_3_TCPWM0_TR_ONE_CNT_IN19},
    {0u, 21u, P4_3, P4_3_TCPWM0_TR_ONE_CNT_IN21},
    {0u, 22u, P4_4, P4_4_TCPWM0_TR_ONE_CNT_IN22},
    {0u, 24u, P4_4, P4_4_TCPWM0_TR_ONE_CNT_IN24},
    {0u, 25u, P5_0, P5_0_TCPWM0_TR_ONE_CNT_IN25},
    {0u, 27u, P5_0, P5_0_TCPWM0_TR_ONE_CNT_IN27},
    {0u, 28u, P5_1, P5_1_TCPWM0_TR_ONE_CNT_IN28},
    {0u, 30u, P5_1, P5_1_TCPWM0_TR_ONE_CNT_IN30},
    {0u, 31u, P5_2, P5_2_TCPWM0_TR_ONE_CNT_IN31},
    {0u, 33u, P5_2, P5_2_TCPWM0_TR_ONE_CNT_IN33},
    {0u, 34u, P5_3, P5_3_TCPWM0_TR_ONE_CNT_IN34},
    {0u, 36u, P5_3, P5_3_TCPWM0_TR_ONE_CNT_IN36},
    {0u, 37u, P5_4, P5_4_TCPWM0_TR_ONE_CNT_IN37},
    {0u, 39u, P5_4, P5_4_TCPWM0_TR_ONE_CNT_IN39},
    {0u, 40u, P5_5, P5_5_TCPWM0_TR_ONE_CNT_IN40},
    {0u, 42u, P5_5, P5_5_TCPWM0_TR_ONE_CNT_IN42},
    {0u, 43u, P6_0, P6_0_TCPWM0_TR_ONE_CNT_IN43},
    {3u, 0u, P6_0, P6_0_TCPWM0_TR_ONE_CNT_IN768},
    {0u, 0u, P6_1, P6_1_TCPWM0_TR_ONE_CNT_IN0},
    {3u, 1u, P6_1, P6_1_TCPWM0_TR_ONE_CNT_IN769},
    {0u, 1u, P6_2, P6_2_TCPWM0_TR_ONE_CNT_IN1},
    {3u, 3u, P6_2, P6_2_TCPWM0_TR_ONE_CNT_IN771},
    {0u, 3u, P6_3, P6_3_TCPWM0_TR_ONE_CNT_IN3},
    {3u, 4u, P6_3, P6_3_TCPWM0_TR_ONE_CNT_IN772},
    {0u, 4u, P6_4, P6_4_TCPWM0_TR_ONE_CNT_IN4},
    {3u, 6u, P6_4, P6_4_TCPWM0_TR_ONE_CNT_IN774},
    {0u, 6u, P6_5, P6_5_TCPWM0_TR_ONE_CNT_IN6},
    {3u, 7u, P6_5, P6_5_TCPWM0_TR_ONE_CNT_IN775},
    {0u, 7u, P6_6, P6_6_TCPWM0_TR_ONE_CNT_IN7},
    {3u, 9u, P6_6, P6_6_TCPWM0_TR_ONE_CNT_IN777},
    {0u, 9u, P6_7, P6_7_TCPWM0_TR_ONE_CNT_IN9},
    {3u, 10u, P6_7, P6_7_TCPWM0_TR_ONE_CNT_IN778},
    {0u, 10u, P7_0, P7_0_TCPWM0_TR_ONE_CNT_IN10},
    {3u, 12u, P7_0, P7_0_TCPWM0_TR_ONE_CNT_IN780},
    {0u, 45u, P7_1, P7_1_TCPWM0_TR_ONE_CNT_IN45},
    {3u, 13u, P7_1, P7_1_TCPWM0_TR_ONE_CNT_IN781},
    {0u, 46u, P7_2, P7_2_TCPWM0_TR_ONE_CNT_IN46},
    {3u, 15u, P7_2, P7_2_TCPWM0_TR_ONE_CNT_IN783},
    {0u, 48u, P7_3, P7_3_TCPWM0_TR_ONE_CNT_IN48},
    {3u, 16u, P7_3, P7_3_TCPWM0_TR_ONE_CNT_IN784},
    {0u, 49u, P7_4, P7_4_TCPWM0_TR_ONE_CNT_IN49},
    {3u, 18u, P7_4, P7_4_TCPWM0_TR_ONE_CNT_IN786},
    {0u, 51u, P7_5, P7_5_TCPWM0_TR_ONE_CNT_IN51},
    {3u, 19u, P7_5, P7_5_TCPWM0_TR_ONE_CNT_IN787},
    {0u, 52u, P7_6, P7_6_TCPWM0_TR_ONE_CNT_IN52},
    {3u, 21u, P7_6, P7_6_TCPWM0_TR_ONE_CNT_IN789},
    {0u, 54u, P7_7, P7_7_TCPWM0_TR_ONE_CNT_IN54},
    {3u, 22u, P7_7, P7_7_TCPWM0_TR_ONE_CNT_IN790},
    {0u, 55u, P8_0, P8_0_TCPWM0_TR_ONE_CNT_IN55},
    {0u, 57u, P8_0, P8_0_TCPWM0_TR_ONE_CNT_IN57},
    {0u, 58u, P8_1, P8_1_TCPWM0_TR_ONE_CNT_IN58},
    {0u, 60u, P8_1, P8_1_TCPWM0_TR_ONE_CNT_IN60},
    {0u, 61u, P8_2, P8_2_TCPWM0_TR_ONE_CNT_IN61},
    {0u, 63u, P8_2, P8_2_TCPWM0_TR_ONE_CNT_IN63},
    {0u, 64u, P8_3, P8_3_TCPWM0_TR_ONE_CNT_IN64},
    {0u, 66u, P8_3, P8_3_TCPWM0_TR_ONE_CNT_IN66},
    {0u, 67u, P8_4, P8_4_TCPWM0_TR_ONE_CNT_IN67},
    {0u, 69u, P8_4, P8_4_TCPWM0_TR_ONE_CNT_IN69},
    {0u, 70u, P9_0, P9_0_TCPWM0_TR_ONE_CNT_IN70},
    {0u, 72u, P9_0, P9_0_TCPWM0_TR_ONE_CNT_IN72},
    {0u, 73u, P9_1, P9_1_TCPWM0_TR_ONE_CNT_IN73},
    {0u, 75u, P9_1, P9_1_TCPWM0_TR_ONE_CNT_IN75},
    {0u, 76u, P9_2, P9_2_TCPWM0_TR_ONE_CNT_IN76},
    {0u, 78u, P9_2, P9_2_TCPWM0_TR_ONE_CNT_IN78},
    {0u, 79u, P9_3, P9_3_TCPWM0_TR_ONE_CNT_IN79},
    {0u, 81u, P9_3, P9_3_TCPWM0_TR_ONE_CNT_IN81},
    {0u, 82u, P10_0, P10_0_TCPWM0_TR_ONE_CNT_IN82},
    {0u, 84u, P10_0, P10_0_TCPWM0_TR_ONE_CNT_IN84},
    {0u, 85u, P10_1, P10_1_TCPWM0_TR_ONE_CNT_IN85},
    {0u, 87u, P10_1, P10_1_TCPWM0_TR_ONE_CNT_IN87},
    {0u, 88u, P10_2, P10_2_TCPWM0_TR_ONE_CNT_IN88},
    {0u, 90u, P10_2, P10_2_TCPWM0_TR_ONE_CNT_IN90},
    {0u, 91u, P10_3, P10_3_TCPWM0_TR_ONE_CNT_IN91},
    {0u, 93u, P10_3, P10_3_TCPWM0_TR_ONE_CNT_IN93},
    {0u, 94u, P10_4, P10_4_TCPWM0_TR_ONE_CNT_IN94},
    {0u, 96u, P10_4, P10_4_TCPWM0_TR_ONE_CNT_IN96},
    {0u, 97u, P10_5, P10_5_TCPWM0_TR_ONE_CNT_IN97},
    {0u, 99u, P10_5, P10_5_TCPWM0_TR_ONE_CNT_IN99},
    {0u, 100u, P10_6, P10_6_TCPWM0_TR_ONE_CNT_IN100},
    {0u, 102u, P10_6, P10_6_TCPWM0_TR_ONE_CNT_IN102},
    {0u, 103u, P10_7, P10_7_TCPWM0_TR_ONE_CNT_IN103},
    {0u, 105u, P10_7, P10_7_TCPWM0_TR_ONE_CNT_IN105},
    {0u, 183u, P11_0, P11_0_TCPWM0_TR_ONE_CNT_IN183},
    {0u, 187u, P11_0, P11_0_TCPWM0_TR_ONE_CNT_IN187},
    {0u, 180u, P11_1, P11_1_TCPWM0_TR_ONE_CNT_IN180},
    {0u, 184u, P11_1, P11_1_TCPWM0_TR_ONE_CNT_IN184},
    {0u, 177u, P11_2, P11_2_TCPWM0_TR_ONE_CNT_IN177},
    {0u, 181u, P11_2, P11_2_TCPWM0_TR_ONE_CNT_IN181},
    {0u, 106u, P12_0, P12_0_TCPWM0_TR_ONE_CNT_IN106},
    {0u, 108u, P12_0, P12_0_TCPWM0_TR_ONE_CNT_IN108},
    {0u, 109u, P12_1, P12_1_TCPWM0_TR_ONE_CNT_IN109},
    {0u, 111u, P12_1, P12_1_TCPWM0_TR_ONE_CNT_IN111},
    {0u, 112u, P12_2, P12_2_TCPWM0_TR_ONE_CNT_IN112},
    {0u, 114u, P12_2, P12_2_TCPWM0_TR_ONE_CNT_IN114},
    {0u, 115u, P12_3, P12_3_TCPWM0_TR_ONE_CNT_IN115},
    {0u, 117u, P12_3, P12_3_TCPWM0_TR_ONE_CNT_IN117},
    {0u, 118u, P12_4, P12_4_TCPWM0_TR_ONE_CNT_IN118},
    {0u, 120u, P12_4, P12_4_TCPWM0_TR_ONE_CNT_IN120},
    {0u, 121u, P12_5, P12_5_TCPWM0_TR_ONE_CNT_IN121},
    {0u, 123u, P12_5, P12_5_TCPWM0_TR_ONE_CNT_IN123},
    {0u, 124u, P12_6, P12_6_TCPWM0_TR_ONE_CNT_IN124},
    {0u, 126u, P12_6, P12_6_TCPWM0_TR_ONE_CNT_IN126},
    {0u, 127u, P12_7, P12_7_TCPWM0_TR_ONE_CNT_IN127},
    {0u, 129u, P12_7, P12_7_TCPWM0_TR_ONE_CNT_IN129},
    {0u, 130u, P13_0, P13_0_TCPWM0_TR_ONE_CNT_IN130},
    {3u, 24u, P13_0, P13_0_TCPWM0_TR_ONE_CNT_IN792},
    {0u, 132u, P13_1, P13_1_TCPWM0_TR_ONE_CNT_IN132},
    {3u, 25u, P13_1, P13_1_TCPWM0_TR_ONE_CNT_IN793},
    {0u, 133u, P13_2, P13_2_TCPWM0_TR_ONE_CNT_IN133},
    {3u, 27u, P13_2, P13_2_TCPWM0_TR_ONE_CNT_IN795},
    {0u, 135u, P13_3, P13_3_TCPWM0_TR_ONE_CNT_IN135},
    {3u, 28u, P13_3, P13_3_TCPWM0_TR_ONE_CNT_IN796},
    {0u, 136u, P13_4, P13_4_TCPWM0_TR_ONE_CNT_IN136},
    {3u, 30u, P13_4, P13_4_TCPWM0_TR_ONE_CNT_IN798},
    {0u, 138u, P13_5, P13_5_TCPWM0_TR_ONE_CNT_IN138},
    {3u, 31u, P13_5, P13_5_TCPWM0_TR_ONE_CNT_IN799},
    {0u, 139u, P13_6, P13_6_TCPWM0_TR_ONE_CNT_IN139},
    {3u, 33u, P13_6, P13_6_TCPWM0_TR_ONE_CNT_IN801},
    {0u, 141u, P13_7, P13_7_TCPWM0_TR_ONE_CNT_IN141},
    {3u, 34u, P13_7, P13_7_TCPWM0_TR_ONE_CNT_IN802},
    {0u, 142u, P14_0, P14_0_TCPWM0_TR_ONE_CNT_IN142},
    {0u, 144u, P14_0, P14_0_TCPWM0_TR_ONE_CNT_IN144},
    {0u, 145u, P14_1, P14_1_TCPWM0_TR_ONE_CNT_IN145},
    {0u, 147u, P14_1, P14_1_TCPWM0_TR_ONE_CNT_IN147},
    {0u, 148u, P14_2, P14_2_TCPWM0_TR_ONE_CNT_IN148},
    {0u, 150u, P14_2, P14_2_TCPWM0_TR_ONE_CNT_IN150},
    {0u, 151u, P14_3, P14_3_TCPWM0_TR_ONE_CNT_IN151},
    {0u, 153u, P14_3, P14_3_TCPWM0_TR_ONE_CNT_IN153},
    {0u, 154u, P14_4, P14_4_TCPWM0_TR_ONE_CNT_IN154},
    {0u, 156u, P14_4, P14_4_TCPWM0_TR_ONE_CNT_IN156},
    {6u, 12u, P14_4, P14_4_TCPWM0_TR_ONE_CNT_IN1548},
    {0u, 157u, P14_5, P14_5_TCPWM0_TR_ONE_CNT_IN157},
    {0u, 159u, P14_5, P14_5_TCPWM0_TR_ONE_CNT_IN159},
    {6u, 13u, P14_5, P14_5_TCPWM0_TR_ONE_CNT_IN1549},
    {0u, 160u, P14_6, P14_6_TCPWM0_TR_ONE_CNT_IN160},
    {0u, 162u, P14_6, P14_6_TCPWM0_TR_ONE_CNT_IN162},
    {6u, 15u, P14_6, P14_6_TCPWM0_TR_ONE_CNT_IN1551},
    {0u, 163u, P14_7, P14_7_TCPWM0_TR_ONE_CNT_IN163},
    {0u, 165u, P14_7, P14_7_TCPWM0_TR_ONE_CNT_IN165},
    {6u, 16u, P14_7, P14_7_TCPWM0_TR_ONE_CNT_IN1552},
    {0u, 166u, P15_0, P15_0_TCPWM0_TR_ONE_CNT_IN166},
    {0u, 168u, P15_0, P15_0_TCPWM0_TR_ONE_CNT_IN168},
    {6u, 18u, P15_0, P15_0_TCPWM0_TR_ONE_CNT_IN1554},
    {0u, 169u, P15_1, P15_1_TCPWM0_TR_ONE_CNT_IN169},
    {0u, 171u, P15_1, P15_1_TCPWM0_TR_ONE_CNT_IN171},
    {6u, 19u, P15_1, P15_1_TCPWM0_TR_ONE_CNT_IN1555},
    {0u, 172u, P15_2, P15_2_TCPWM0_TR_ONE_CNT_IN172},
    {0u, 174u, P15_2, P15_2_TCPWM0_TR_ONE_CNT_IN174},
    {6u, 21u, P15_2, P15_2_TCPWM0_TR_ONE_CNT_IN1557},
    {0u, 175u, P15_3, P15_3_TCPWM0_TR_ONE_CNT_IN175},
    {0u, 177u, P15_3, P15_3_TCPWM0_TR_ONE_CNT_IN177},
    {6u, 22u, P15_3, P15_3_TCPWM0_TR_ONE_CNT_IN1558},
    {0u, 186u, P16_3, P16_3_TCPWM0_TR_ONE_CNT_IN186},
    {0u, 187u, P16_3, P16_3_TCPWM0_TR_ONE_CNT_IN187},
    {0u, 183u, P17_0, P17_0_TCPWM0_TR_ONE_CNT_IN183},
    {0u, 187u, P17_0, P17_0_TCPWM0_TR_ONE_CNT_IN187},
    {0u, 180u, P17_1, P17_1_TCPWM0_TR_ONE_CNT_IN180},
    {0u, 184u, P17_1, P17_1_TCPWM0_TR_ONE_CNT_IN184},
    {0u, 177u, P17_2, P17_2_TCPWM0_TR_ONE_CNT_IN177},
    {0u, 181u, P17_2, P17_2_TCPWM0_TR_ONE_CNT_IN181},
    {0u, 174u, P17_3, P17_3_TCPWM0_TR_ONE_CNT_IN174},
    {0u, 178u, P17_3, P17_3_TCPWM0_TR_ONE_CNT_IN178},
    {0u, 171u, P17_4, P17_4_TCPWM0_TR_ONE_CNT_IN171},
    {0u, 175u, P17_4, P17_4_TCPWM0_TR_ONE_CNT_IN175},
    {0u, 168u, P17_5, P17_5_TCPWM0_TR_ONE_CNT_IN168},
    {0u, 172u, P17_5, P17_5_TCPWM0_TR_ONE_CNT_IN172},
    {0u, 169u, P17_6, P17_6_TCPWM0_TR_ONE_CNT_IN169},
    {3u, 12u, P17_6, P17_6_TCPWM0_TR_ONE_CNT_IN780},
    {3u, 13u, P17_7, P17_7_TCPWM0_TR_ONE_CNT_IN781},
    {3u, 15u, P17_7, P17_7_TCPWM0_TR_ONE_CNT_IN783},
    {3u, 16u, P18_0, P18_0_TCPWM0_TR_ONE_CNT_IN784},
    {3u, 18u, P18_0, P18_0_TCPWM0_TR_ONE_CNT_IN786},
    {3u, 19u, P18_1, P18_1_TCPWM0_TR_ONE_CNT_IN787},
    {3u, 21u, P18_1, P18_1_TCPWM0_TR_ONE_CNT_IN789},
    {0u, 165u, P18_2, P18_2_TCPWM0_TR_ONE_CNT_IN165},
    {3u, 22u, P18_2, P18_2_TCPWM0_TR_ONE_CNT_IN790},
    {0u, 162u, P18_3, P18_3_TCPWM0_TR_ONE_CNT_IN162},
    {0u, 166u, P18_3, P18_3_TCPWM0_TR_ONE_CNT_IN166},
    {0u, 159u, P18_4, P18_4_TCPWM0_TR_ONE_CNT_IN159},
    {0u, 163u, P18_4, P18_4_TCPWM0_TR_ONE_CNT_IN163},
    {0u, 156u, P18_5, P18_5_TCPWM0_TR_ONE_CNT_IN156},
    {0u, 160u, P18_5, P18_5_TCPWM0_TR_ONE_CNT_IN160},
    {0u, 153u, P18_6, P18_6_TCPWM0_TR_ONE_CNT_IN153},
    {0u, 157u, P18_6, P18_6_TCPWM0_TR_ONE_CNT_IN157},
    {0u, 150u, P18_7, P18_7_TCPWM0_TR_ONE_CNT_IN150},
    {0u, 154u, P18_7, P18_7_TCPWM0_TR_ONE_CNT_IN154},
    {0u, 151u, P19_0, P19_0_TCPWM0_TR_ONE_CNT_IN151},
    {3u, 9u, P19_0, P19_0_TCPWM0_TR_ONE_CNT_IN777},
    {6u, 0u, P19_0, P19_0_TCPWM0_TR_ONE_CNT_IN1536},
    {0u, 78u, P19_1, P19_1_TCPWM0_TR_ONE_CNT_IN78},
    {3u, 10u, P19_1, P19_1_TCPWM0_TR_ONE_CNT_IN778},
    {6u, 1u, P19_1, P19_1_TCPWM0_TR_ONE_CNT_IN1537},
    {0u, 79u, P19_2, P19_2_TCPWM0_TR_ONE_CNT_IN79},
    {0u, 81u, P19_2, P19_2_TCPWM0_TR_ONE_CNT_IN81},
    {6u, 3u, P19_2, P19_2_TCPWM0_TR_ONE_CNT_IN1539},
    {0u, 82u, P19_3, P19_3_TCPWM0_TR_ONE_CNT_IN82},
    {0u, 84u, P19_3, P19_3_TCPWM0_TR_ONE_CNT_IN84},
    {6u, 4u, P19_3, P19_3_TCPWM0_TR_ONE_CNT_IN1540},
    {0u, 85u, P19_4, P19_4_TCPWM0_TR_ONE_CNT_IN85},
    {0u, 87u, P19_4, P19_4_TCPWM0_TR_ONE_CNT_IN87},
    {6u, 6u, P19_4, P19_4_TCPWM0_TR_ONE_CNT_IN1542},
    {0u, 88u, P20_0, P20_0_TCPWM0_TR_ONE_CNT_IN88},
    {0u, 90u, P20_0, P20_0_TCPWM0_TR_ONE_CNT_IN90},
    {6u, 7u, P20_0, P20_0_TCPWM0_TR_ONE_CNT_IN1543},
    {0u, 91u, P20_1, P20_1_TCPWM0_TR_ONE_CNT_IN91},
    {0u, 147u, P20_1, P20_1_TCPWM0_TR_ONE_CNT_IN147},
    {6u, 9u, P20_1, P20_1_TCPWM0_TR_ONE_CNT_IN1545},
    {0u, 144u, P20_2, P20_2_TCPWM0_TR_ONE_CNT_IN144},
    {0u, 148u, P20_2, P20_2_TCPWM0_TR_ONE_CNT_IN148},
    {6u, 10u, P20_2, P20_2_TCPWM0_TR_ONE_CNT_IN1546},
    {0u, 141u, P20_3, P20_3_TCPWM0_TR_ONE_CNT_IN141},
    {0u, 145u, P20_3, P20_3_TCPWM0_TR_ONE_CNT_IN145},
    {0u, 138u, P20_4, P20_4_TCPWM0_TR_ONE_CNT_IN138},
    {0u, 142u, P20_4, P20_4_TCPWM0_TR_ONE_CNT_IN142},
    {0u, 135u, P20_5, P20_5_TCPWM0_TR_ONE_CNT_IN135},
    {0u, 139u, P20_5, P20_5_TCPWM0_TR_ONE_CNT_IN139},
    {0u, 132u, P20_6, P20_6_TCPWM0_TR_ONE_CNT_IN132},
    {0u, 136u, P20_6, P20_6_TCPWM0_TR_ONE_CNT_IN136},
    {0u, 129u, P20_7, P20_7_TCPWM0_TR_ONE_CNT_IN129},
    {0u, 133u, P20_7, P20_7_TCPWM0_TR_ONE_CNT_IN133},
    {0u, 126u, P21_0, P21_0_TCPWM0_TR_ONE_CNT_IN126},
    {0u, 130u, P21_0, P21_0_TCPWM0_TR_ONE_CNT_IN130},
    {0u, 123u, P21_1, P21_1_TCPWM0_TR_ONE_CNT_IN123},
    {0u, 127u, P21_1, P21_1_TCPWM0_TR_ONE_CNT_IN127},
    {0u, 120u, P21_2, P21_2_TCPWM0_TR_ONE_CNT_IN120},
    {0u, 124u, P21_2, P21_2_TCPWM0_TR_ONE_CNT_IN124},
    {0u, 117u, P21_3, P21_3_TCPWM0_TR_ONE_CNT_IN117},
    {0u, 121u, P21_3, P21_3_TCPWM0_TR_ONE_CNT_IN121},
    {0u, 114u, P21_4, P21_4_TCPWM0_TR_ONE_CNT_IN114},
    {0u, 118u, P21_4, P21_4_TCPWM0_TR_ONE_CNT_IN118},
    {0u, 102u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN102},
    {0u, 106u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN106},
    {0u, 111u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN111},
    {0u, 115u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN115},
    {0u, 108u, P21_6, P21_6_TCPWM0_TR_ONE_CNT_IN108},
    {0u, 112u, P21_6, P21_6_TCPWM0_TR_ONE_CNT_IN112},
    {0u, 105u, P21_7, P21_7_TCPWM0_TR_ONE_CNT_IN105},
    {0u, 109u, P21_7, P21_7_TCPWM0_TR_ONE_CNT_IN109},
    {0u, 99u, P22_1, P22_1_TCPWM0_TR_ONE_CNT_IN99},
    {0u, 103u, P22_1, P22_1_TCPWM0_TR_ONE_CNT_IN103},
    {0u, 96u, P22_2, P22_2_TCPWM0_TR_ONE_CNT_IN96},
    {0u, 100u, P22_2, P22_2_TCPWM0_TR_ONE_CNT_IN100},
    {0u, 93u, P22_3, P22_3_TCPWM0_TR_ONE_CNT_IN93},
    {0u, 97u, P22_3, P22_3_TCPWM0_TR_ONE_CNT_IN97},
    {0u, 90u, P22_4, P22_4_TCPWM0_TR_ONE_CNT_IN90},
    {0u, 94u, P22_4, P22_4_TCPWM0_TR_ONE_CNT_IN94},
    {0u, 87u, P22_5, P22_5_TCPWM0_TR_ONE_CNT_IN87},
    {0u, 91u, P22_5, P22_5_TCPWM0_TR_ONE_CNT_IN91},
    {0u, 84u, P22_6, P22_6_TCPWM0_TR_ONE_CNT_IN84},
    {0u, 88u, P22_6, P22_6_TCPWM0_TR_ONE_CNT_IN88},
    {0u, 81u, P22_7, P22_7_TCPWM0_TR_ONE_CNT_IN81},
    {0u, 85u, P22_7, P22_7_TCPWM0_TR_ONE_CNT_IN85},
    {0u, 82u, P23_0, P23_0_TCPWM0_TR_ONE_CNT_IN82},
    {3u, 24u, P23_0, P23_0_TCPWM0_TR_ONE_CNT_IN792},
    {3u, 25u, P23_1, P23_1_TCPWM0_TR_ONE_CNT_IN793},
    {3u, 27u, P23_1, P23_1_TCPWM0_TR_ONE_CNT_IN795},
    {3u, 28u, P23_2, P23_2_TCPWM0_TR_ONE_CNT_IN796},
    {3u, 30u, P23_2, P23_2_TCPWM0_TR_ONE_CNT_IN798},
    {3u, 31u, P23_3, P23_3_TCPWM0_TR_ONE_CNT_IN799},
    {3u, 33u, P23_3, P23_3_TCPWM0_TR_ONE_CNT_IN801},
    {0u, 75u, P23_4, P23_4_TCPWM0_TR_ONE_CNT_IN75},
    {3u, 34u, P23_4, P23_4_TCPWM0_TR_ONE_CNT_IN802},
    {0u, 72u, P23_5, P23_5_TCPWM0_TR_ONE_CNT_IN72},
    {0u, 76u, P23_5, P23_5_TCPWM0_TR_ONE_CNT_IN76},
    {0u, 69u, P23_6, P23_6_TCPWM0_TR_ONE_CNT_IN69},
    {0u, 73u, P23_6, P23_6_TCPWM0_TR_ONE_CNT_IN73},
    {0u, 66u, P23_7, P23_7_TCPWM0_TR_ONE_CNT_IN66},
    {0u, 70u, P23_7, P23_7_TCPWM0_TR_ONE_CNT_IN70},
};

#endif
